phonght32/PIFBot/stm32f4_ros/src/main.cpp
/******************************** Include *********************************** */

#include "../robot/include/robot_config.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_rcc.h"
#include "main.h"

#include "stdio.h"
#include "math.h"
#include "string.h"

#include "../components/driver/include/timer.h"
#include "../components/driver/include/i2c.h"
#include "../components/driver/include/gpio.h"
#include "../components/driver/include/uart.h"
#include "../components/mpu6050/include/mpu6050.h"
#include "../components/step_driver/include/step_driver.h"



/*************************** ***** Define *********************************** */

#define MOTOR_LEFT_FORWARD(_handle_)	step_driver_set_dir(_handle_, 0);
#define MOTOR_LEFT_BACKWARD(_handle_)	step_driver_set_dir(_handle_, 1);
#define MOTOR_RIGHT_FORWARD(_handle_)	step_driver_set_dir(_handle_, 1);
#define MOTOR_RIGHT_BACKWARD(_handle_)	step_driver_set_dir(_handle_, 0);


/********************************** ROS ************************************* */
UART_HandleTypeDef huart4;
DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart4_tx;
void robot_rosserial_init(void);

/********************************* MOTOR ************************************ */
step_driver_handle_t motor_left, motor_right;
void robot_motor_init(void);

/******************************** MPU6050 *********************************** */
mpu6050_handle_t mpu6050;
I2C_HandleTypeDef mpu6050_i2c;
void robot_mpu6050_init(void);


/****************************** STM32 System ******************************** */
TIM_HandleTypeDef htim5;
void timer_interval_init(void);

void SystemClock_Config(void);
void Error_Handler(void);

sensor_msgs::Imu getIMU(void);
void ros_setup(void);
void initIMU(void);
void calibrationGyro(void);
void getOrientation(float *orientation);
float constrain(float x, float low_val, float high_val);
void controlMotor(float *goal_vel);
void getMotorSpeed(float *vel);

uint32_t tickcount_ms;
uint32_t millis(void);



std_msgs::String str_msg;
ros::Publisher chatter("chatter", &str_msg);

ros::Time time_ros;

int main(void)
{
    HAL_Init();
    SystemClock_Config();

    /* ROS configuration */
    robot_rosserial_init();

    /* Motor configuration */
    robot_motor_init();

    /* MPU6050 configuration */
    robot_mpu6050_init();

    timer_interval_init();
    HAL_TIM_Base_Start_IT(&htim5);

    ros_setup();

    step_driver_set_freq(motor_left,3200);
    step_driver_set_freq(motor_right,3200);
    MOTOR_LEFT_FORWARD(motor_left);
    MOTOR_RIGHT_FORWARD(motor_right);


    while (1)
    {

//    	uint32_t t = millis();
//    	updateTime();
//    	updateVariable(nh.connected());
//    	updateTFPrefix(nh.connected());
//
//    	if((t-tTime[CONTROL_MOTOR_TIME_INDEX] >= 1000/CONTROL_MOTOR_SPEED_FREQUENCY))
//    	{
//    		updateGoalVelocity();
//    		if((t-tTime[CONTROL_MOTOR_TIMEOUT_TIME_INDEX]))
//    		{
//    			controlMotor(zero_velocity);
//    		}
//    		else
//    		{
//    			controlMotor(goal_velocity);
//    		}
//    		tTime[CONTROL_MOTOR_TIME_INDEX] = t;
//    	}
//
//    	if ((t-tTime[CMD_VEL_PUBLISH_TIME_INDEX]) >= (1000 / CMD_VEL_PUBLISH_FREQUENCY))
//    	{
//    	    publishCmdVelFromMotorMsg();
//    	    tTime[CMD_VEL_PUBLISH_TIME_INDEX] = t;
//    	}
//
//    	if ((t-tTime[DRIVE_INFORMATION_PUBLISH_TIME_INDEX]) >= (1000 / DRIVE_INFORMATION_PUBLISH_FREQUENCY))
//    	{
//    	    publishDriveInformation();
//    	    tTime[DRIVE_INFORMATION_PUBLISH_TIME_INDEX] = t;
//    	}
//
//    	if ((t-tTime[IMU_PUBLISH_TIME_INDEX]) >= (1000 / IMU_PUBLISH_FREQUENCY))
//    	{
//    	    publishImuMsg();
//    	    tTime[IMU_PUBLISH_TIME_INDEX] = t;
//    	}
//
//    	getIMU();
//    	getMotorSpeed(goal_velocity_from_motor);
//
//    	nh.spinOnce();
//
//    	waitForSerialLink(nh.connected());
    }
}

void ros_setup(void)
{
	nh.initNode();

	nh.subscribe(cmd_vel_sub);
	nh.subscribe(reset_sub);

	nh.advertise(imu_pub);
	nh.advertise(cmd_vel_motor_pub);
	nh.advertise(odom_pub);
	nh.advertise(joint_states_pub);
	nh.advertise(battery_state_pub);

	tf_broadcaster.init(nh);

	initOdom();

	initJointStates();

	prev_update_time = millis();

	setup_end = true;
}

void robot_mpu6050_init(void)
{
	i2c_config_t i2c_config;
	i2c_config.i2c_num = I2C_NUM_1;
	i2c_config.i2c_pins_pack = I2C_PINS_PACK_1;
	i2c_handle_t i2c_handle = i2c_init(&i2c_config);

	mpu6050_i2c = i2c_get_I2C_HandleTypeDef(i2c_handle);
	mpu6050_i2c_config(&mpu6050_i2c);

    mpu6050_config_t mpu6050_config;
    mpu6050_config.afs_sel = MPU6050_AFS_SEL_4G;
    mpu6050_config.clksel = MPU6050_CLKSEL_INTERNAL_8_MHZ;
    mpu6050_config.dlpf_cfg =  MPU6050_184ACCEL_188GYRO_BW_HZ;
    mpu6050_config.fs_sel = MPU6050_FS_SEL_500;
    mpu6050_config.sleep_mode = MPU6050_DISABLE_SLEEP_MODE;
    mpu6050 = mpu6050_init(&mpu6050_config);
}

void robot_motor_init(void)
{
    step_driver_config_t motor_left_config;
    motor_left_config.pin_clk.timer_num = TIMER_NUM_3;
    motor_left_config.pin_clk.timer_channel = TIMER_CHANNEL_2;
	motor_left_config.pin_clk.timer_pins_pack = TIMER_PINS_PACK_1;
	motor_left_config.pin_dir.gpio_port = GPIO_PORT_C;
	motor_left_config.pin_dir.gpio_num = GPIO_NUM_5;
	motor_left_config.pin_dir.gpio_mode = GPIO_OUTPUT;
	motor_left_config.pin_dir.gpio_reg_pull = GPIO_REG_PULL_NONE;
	motor_left = step_driver_init(&motor_left_config);

	step_driver_config_t motor_right_config;
	motor_right_config.pin_clk.timer_num = TIMER_NUM_2;
	motor_right_config.pin_clk.timer_channel = TIMER_CHANNEL_1;
	motor_right_config.pin_clk.timer_pins_pack = TIMER_PINS_PACK_2;
	motor_right_config.pin_dir.gpio_port = GPIO_PORT_A;
	motor_right_config.pin_dir.gpio_num = GPIO_NUM_3;
	motor_right_config.pin_dir.gpio_mode = GPIO_OUTPUT;
	motor_right_config.pin_dir.gpio_reg_pull = GPIO_REG_PULL_NONE;
	motor_right = step_driver_init(&motor_right_config);
	step_driver_start(motor_left);
	step_driver_start(motor_right);


