phonght32/PIFBot/stm32f4_ros/src/main.cpp
    wheel_l = TICK2RAD * (double)last_diff_tick[LEFT];
    wheel_r = TICK2RAD * (double)last_diff_tick[RIGHT];

    if (isnan(wheel_l))
        wheel_l = 0.0;

    if (isnan(wheel_r))
        wheel_r = 0.0;

    delta_s     = WHEEL_RADIUS * (wheel_r + wheel_l) / 2.0;
    // theta = WHEEL_RADIUS * (wheel_r - wheel_l) / WHEEL_SEPARATION;
    getOrientation(orientation);
    theta       = atan2f(orientation[1] * orientation[2] + orientation[0] * orientation[3],
                         0.5f - orientation[2] * orientation[2] - orientation[3] * orientation[3]);

    delta_theta = theta - last_theta;

    // compute odometric pose
    odom_pose[0] += delta_s * cos(odom_pose[2] + (delta_theta / 2.0));
    odom_pose[1] += delta_s * sin(odom_pose[2] + (delta_theta / 2.0));
    odom_pose[2] += delta_theta;

    // compute odometric instantaneouse velocity

    v = delta_s / step_time;
    w = delta_theta / step_time;

    odom_vel[0] = v;
    odom_vel[1] = 0.0;
    odom_vel[2] = w;

    last_velocity[LEFT]  = wheel_l / step_time;
    last_velocity[RIGHT] = wheel_r / step_time;
    last_theta = theta;

    return true;
}

void sendLogMsg(void)
{
    static bool log_flag = false;
    char log_msg[100];

//    String name             = NAME;
//    String firmware_version = FIRMWARE_VER;
//    String bringup_log      = "This core(v" + firmware_version + ") is compatible with TB3 " + name;
//
//    const char* init_log_data = bringup_log.c_str();

    if (nh.connected())
    {
        if (log_flag == false)
        {
            sprintf(log_msg, "--------------------------");
            nh.loginfo(log_msg);

            sprintf(log_msg, "Connected to OpenCR board!");
            nh.loginfo(log_msg);

//        sprintf(log_msg, init_log_data);
//        nh.loginfo(log_msg);

            sprintf(log_msg, "--------------------------");
            nh.loginfo(log_msg);

            log_flag = true;
        }
    }
    else
    {
        log_flag = false;
    }
}

void waitForSerialLink(bool isConnected)
{
    static bool wait_flag = false;

    if (isConnected)
    {
        if (wait_flag == false)
        {
            HAL_Delay(10);

            wait_flag = true;
        }
    }
    else
    {
        wait_flag = false;
    }
}

uint32_t millis(void)
{
    return tickcount_ms;
}

sensor_msgs::Imu getIMU(void)
{
	mpu6050_scaled_data_t accel_scale;
	mpu6050_scaled_data_t gyro_scale;
	mpu6050_quat_data_t quat;
	mpu6050_get_accel_scale(&accel_scale);
	mpu6050_get_gyro_scale(&gyro_scale);
	mpu6050_get_quat(&quat);

	sensor_msgs::Imu imu_msg_;

	  imu_msg_.angular_velocity.x = gyro_scale.x_axis;
	  imu_msg_.angular_velocity.y = gyro_scale.y_axis;
	  imu_msg_.angular_velocity.z = gyro_scale.z_axis;
	  imu_msg_.angular_velocity_covariance[1] = 0;
	  imu_msg_.angular_velocity_covariance[2] = 0;
	  imu_msg_.angular_velocity_covariance[3] = 0;
	  imu_msg_.angular_velocity_covariance[4] = 0.02;
	  imu_msg_.angular_velocity_covariance[5] = 0;
	  imu_msg_.angular_velocity_covariance[6] = 0;
	  imu_msg_.angular_velocity_covariance[7] = 0;
	  imu_msg_.angular_velocity_covariance[8] = 0.02;

	  imu_msg_.linear_acceleration.x = accel_scale.x_axis;
	  imu_msg_.linear_acceleration.y = accel_scale.y_axis;
	  imu_msg_.linear_acceleration.z = accel_scale.z_axis;

	  imu_msg_.linear_acceleration_covariance[0] = 0.04;
	  imu_msg_.linear_acceleration_covariance[1] = 0;
	  imu_msg_.linear_acceleration_covariance[2] = 0;
	  imu_msg_.linear_acceleration_covariance[3] = 0;
	  imu_msg_.linear_acceleration_covariance[4] = 0.04;
	  imu_msg_.linear_acceleration_covariance[5] = 0;
	  imu_msg_.linear_acceleration_covariance[6] = 0;
	  imu_msg_.linear_acceleration_covariance[7] = 0;
	  imu_msg_.linear_acceleration_covariance[8] = 0.04;

	  imu_msg_.orientation.w = quat.q0;
	  imu_msg_.orientation.x = quat.q1;
	  imu_msg_.orientation.y = quat.q2;
	  imu_msg_.orientation.z = quat.q3;

	  imu_msg_.orientation_covariance[0] = 0.0025;
	  imu_msg_.orientation_covariance[1] = 0;
	  imu_msg_.orientation_covariance[2] = 0;
	  imu_msg_.orientation_covariance[3] = 0;
	  imu_msg_.orientation_covariance[4] = 0.0025;
	  imu_msg_.orientation_covariance[5] = 0;
	  imu_msg_.orientation_covariance[6] = 0;
	  imu_msg_.orientation_covariance[7] = 0;
	  imu_msg_.orientation_covariance[8] = 0.0025;

	  return imu_msg_;
}

float constrain(float x, float low_val, float high_val)
{
	float value;
	if(x>high_val)
	{
		value = high_val;
	}
	else if(x<low_val)
	{
		value = low_val;
	}
	else
	{
		value = x;
	}
	return value;
}

void initIMU(void)
{

}

void getOrientation(float *orientation)
{
	mpu6050_quat_data_t quat;
	mpu6050_get_quat(&quat);
	orientation[0] = quat.q0;
	orientation[1] = quat.q1;
	orientation[2] = quat.q2;
	orientation[3] = quat.q3;


}

void calibrationGyro(void)
{

}

void timer_interval_init(void)
{
	TIM_ClockConfigTypeDef sClockSourceConfig = {0};
	  TIM_MasterConfigTypeDef sMasterConfig = {0};

	  /* USER CODE BEGIN TIM5_Init 1 */

	  /* USER CODE END TIM5_Init 1 */
	  htim5.Instance = TIM5;
	  htim5.Init.Prescaler = 83;
	  htim5.Init.CounterMode = TIM_COUNTERMODE_UP;
	  htim5.Init.Period = 999;
	  htim5.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	  htim5.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
	  if (HAL_TIM_Base_Init(&htim5) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
	  if (HAL_TIM_ConfigClockSource(&htim5, &sClockSourceConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
	  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
	  if (HAL_TIMEx_MasterConfigSynchronization(&htim5, &sMasterConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
}

void controlMotor(float *goal_vel)
{
	float wheel_velocity_cmd[2];

	float lin_vel = goal_vel[LEFT];
	float ang_vel = goal_vel[RIGHT];

	wheel_velocity_cmd[LEFT]  = lin_vel - (ang_vel*WHEEL_SEPARATION/2);
	wheel_velocity_cmd[RIGHT] = lin_vel + (ang_vel*WHEEL_SEPARATION/2);

	wheel_velocity_cmd[LEFT] = constrain(wheel_velocity_cmd[LEFT], MIN_LINEAR_VELOCITY, MAX_LINEAR_VELOCITY);
	wheel_velocity_cmd[RIGHT] = constrain(wheel_velocity_cmd[RIGHT], MIN_LINEAR_VELOCITY, MAX_LINEAR_VELOCITY);

	float freq_motor_left = abs(wheel_velocity_cmd[LEFT])*15433;
	float freq_motor_right = abs(wheel_velocity_cmd[RIGHT])*15433;

	if(wheel_velocity_cmd[LEFT] < 0)
	{
		MOTOR_LEFT_BACKWARD(motor_left);
		step_driver_set_freq(motor_left, (uint32_t)freq_motor_left);
	}
	else
	{
		MOTOR_LEFT_FORWARD(motor_left);
		step_driver_set_freq(motor_left, (uint32_t)freq_motor_left);
	}

	if(wheel_velocity_cmd[RIGHT] < 0)
	{
		MOTOR_RIGHT_BACKWARD(motor_right);
		step_driver_set_freq(motor_right, (uint32_t)freq_motor_right);
	}
	else
	{
		MOTOR_RIGHT_FORWARD(motor_right);
		step_driver_set_freq(motor_right, (uint32_t)freq_motor_right);
	}


}

void getMotorSpeed(float *vel)
{
	goal_velocity_from_motor[LINEAR] = goal_velocity_from_cmd[LINEAR];
	goal_velocity_from_motor[ANGULAR] = goal_velocity_from_cmd[ANGULAR];
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if(htim->Instance ==  htim5.Instance)
	{
		tickcount_ms++;
	}
}

void Error_Handler(void)
{

}

#ifdef  USE_FULL_ASSERT

void assert_failed(uint8_t *file, uint32_t line)
{

}
#endif /* USE_FULL_ASSERT */

